
[
[
"Would you like some coffee?"
,
"Хотите ли вы кофе?"
],
[
"Which would you like, tea or coffee?"
,
"Что бы вы хотели, чай или кофе?"
],
[
"Would you like to go for a walk?"
,
"Хотите пойти на прогулку?"
],
[
"Would you like to come for dinner on Sunday?"
,
"Хотите прийти на ужин в воскресенье?"
],
[
"What would you like to do tonight?"
,
"Что бы ты хотел сделать сегодня вечером?"
],
[
"I'm thirsty. I'd like a drink."
,
"Я хочу пить. Я бы хотел что-нибудь выпить."
],
[
"I'm feeling tired. I'd like to stay home tonight."
,
"Я чувствую усталость. Я бы хотел остаться дома сегодня вечером."
],
[
"Would you like to go to the movies tonight?"
,
"Хотели бы вы пойти в кино сегодня вечером?"
],
[
"I'd like an orange, please."
,
"Мне апельсин, пожалуйста."
],
[
"What would you like to do next weekend?"
,
"Чем бы ты хотел заняться в следующие выходные?"
],
[
"I like oranges."
,
"Мне нравятся апельсины."
],
[
"Do you like to go to the movies?"
,
"Любишь ли ты ходить в кино?"
],
[
"Do you like coffee?"
,
"Вам нравится кофе?"
],
[
"What do you like to do on weekends?"
,
"Что ты любишь делать по выходным?"
],
[
"I'd rather sit on the floor."
,
"Я лучше сяду на пол."
],
[
"I don't really want to go out. I'd rather stay home."
,
"Я действительно не хочу выходить на улицу. Я лучше останусь дома."
],
[
"Should we go now? No, not yet. I'd rather wait until later"
,
"Должны ли мы идти сейчас? Нет, не сейчас. Я лучше подожду позже"
],
[
"I'd like to go now, but Tom would rather wait until later."
,
"Я бы хотел пойти сейчас, но Том предпочел бы подождать позже."
],
[
"I don't like to be late. I'd rather be early."
,
"Я не люблю опаздывать. Я бы предпочел прийти пораньше."
],
[
"I'm feeling tired. I'd rather not go out tonight."
,
"Я чувствую усталость. Я бы предпочел не выходить сегодня вечером."
],
[
"Sue is feeling tired. She'd rather not go out tonight."
,
"Сью чувствует себя уставшей. Она предпочла бы не выходить сегодня вечером."
],
[
"We're not hungry. We'd rather not eat yet."
,
"Мы не голодны. Мы бы предпочли пока не есть."
],
[
"Would you like to go out tonight? I'd rather not"
,
"Хотели бы вы пойти куда-нибудь сегодня вечером? я предпочел бы не"
],
[
"Would you rather have milk or juice? Juice, please."
,
"Вы бы предпочли молоко или сок? Сок, пожалуйста."
],
[
"Which would you rather do - go to the movie theater or watch a movie at home?"
,
"Что бы вы предпочли сделать – пойти в кинотеатр или посмотреть фильм дома?"
],
[
"I'd rather go out than stay home."
,
"Я лучше выйду, чем останусь дома."
],
[
"I'd rather have a dog than a cat."
,
"Я бы предпочел собаку, чем кошку."
],
[
"I'd rather be at home right now than here."
,
"Я лучше буду сейчас дома, чем здесь."
],
[
"Come here and look at this. What is it?"
,
"Подойди сюда и посмотри на это. Что это такое?"
],
[
"I don't want to talk to you. Go away!"
,
"Я не хочу с тобой разговаривать. Уходи!"
],
[
"Have a nice time!"
,
"Желаем приятно провести время!"
],
[
"Have a chocolate!"
,
"Съешь шоколадку!"
],
[
"Be careful! Don't fall."
,
"Будь осторожен! Не упади!."
],
[
"Please don't go. Stay here with me."
,
"Пожалуйста, не уходи. Останься тут, со мной."
],
[
"Be here on time. Don't be late."
,
"Будьте здесь вовремя. Не опаздывайте."
],
[
"It's a nice day. Let's go out."
,
"Какой чудесный день. Давай выйдем."
],
[
"Let's have fish for dinner tonight."
,
"Давай сегодня поужинаем рыбу."
],
[
"It's cold. Let's not go out. Let's stay home."
,
"Холодно. Давайте не выходить. Давай останемся дома."
],
[
"There's a big tree in the yard."
,
"Во дворе большое дерево."
],
[
"Yes, there's some in my wallet."
,
"Да, немного есть в моем бумажнике."
],
[
"We can't go skiing. There isn't any snow."
,
"Мы не можем кататься на лыжах. Снега нет."
],
[
"There are some big trees in the yard."
,
"Во дворе есть большие деревья."
],
[
"Are there any restaurants near here?"
,
"Есть ли поблизости рестораны?"
],
[
"This restaurant is very quiet. There aren't many people here."
,
"В этом ресторане очень тихо. Здесь не так много людей."
],
[
"How many players are there on a soccer team?"
,
"Сколько игроков в футбольной команде?"
],
[
"What's that noise? It's a train."
,
"Что это за шум? Это поезд."
],
[
"There's a lot of salt in this soup."
,
"В этом супе много соли."
],
[
"I don't like this soup. It's too salty."
,
"Мне не нравится этот суп. Он слишком соленый."
]
]
