
[
[
"Dave used to work in a factory. Now he works in a supermarket."
,
"Дэйв работал на фабрике. Сейчас он работает в супермаркете."
],
[
"When I was a child, I used to like chocolate."
,
"Когда я был ребенком, я любил шоколад."
],
[
"I used to read a lot of books, but I don't read much these days."
,
"Раньше я читал много книг, но не читаю много теперь."
],
[
"Liz has short hair now, but it used to be very long."
,
"Сейчас у Лиз короткие волосы, а раньше они были очень длинными."
],
[
"They used to live on the same street as us, so we used to see them a lot. But we don't see them much anymore."
,
"Раньше они жили на той же улице, что и мы, так что мы часто их видели. Но мы не видим их больше теперь."
],
[
"Allison used to have a piano, but she sold it a few years ago."
,
"У Эллисон раньше было пианино, но она продала его несколько лет назад."
],
[
"I didn't use to like tomatoes, but I like them now."
,
"Раньше я не любил помидоры, но теперь они мне нравятся."
],
[
"Where did you use to live before you came here?"
,
"Где вы жили до того, как приехали сюда?"
],
[
"I used to play tennis. Now I play golf."
,
"Раньше я играл в теннис. Сейчас я играю в гольф."
],
[
"Have you been to France? No, I haven't."
,
"Вы были во Франции? Нет."
],
[
"We've been to Canada, but we haven't been to Alaska."
,
"Мы были в Канаде, но не были на Аляске."
],
[
"Mary is an interesting person. She has had many different jobs and has lived in many different places."
,
"Мария интересный человек. У нее было много разных работ и она жила в разных местах."
],
[
"I've seen that woman before, but I can't remember where."
,
"Я видел эту женщину раньше, но не могу вспомнить где."
],
[
"How many times has Brazil won the World Cup?"
,
"Сколько раз Бразилия выигрывала чемпионат мира?"
],
[
"Have you read this book? Yes, I've read it twice."
,
"Читали ли вы эту книгу? Да, я прочитал это дважды."
],
[
"Has Michelle ever been to Australia? Yes, once."
,
"Мишель когда-нибудь была в Австралии? Да однажды."
],
[
"Have you ever played golf? Yes, I play a lot."
,
"Вы когда-нибудь играли в гольф? Да, я много играю."
],
[
"My sister has never traveled by plane."
,
"Моя сестра никогда не путешествовала на самолете."
],
[
"I've never ridden a horse."
,
"Я никогда не ездил на лошади."
],
[
"Who is that man? I don't know. I've never seen him before."
,
"Кто этот человек? Я не знаю. Я никогда не видел его раньше."
],
[
"How long has she been in Brazil?"
,
"Как долго она находится в Бразилии?"
],
[
"They have been married for five years."
,
"Они женаты уже пять лет."
],
[
"How long have you been married?"
,
"Как долго вы женаты?"
],
[
"How long have you known her?"
,
"Как долго вы знате ее?"
],
[
"I've known her for a long time."
,
"Я знаю ее уже давно."
],
[
"How long has she lived in Brasil?"
,
"Как долго она живет в Бразилии?"
],
[
"She has lived there all her life."
,
"Она живет там всю свою жизнь."
],
[
"How long have you had your car?"
,
"Как давно у тебя машина?"
],
[
"I've had it since April."
,
"У меня она с апреля."
],
[
"How long have you been studying German?"
,
"Как долго вы изучаете немецкий язык?"
],
[
"I've been studying German for two years."
,
"Я изучаю немецкий язык два года."
],
[
"How long has he been watching TV?"
,
"Как долго он смотрит телевизор?"
],
[
"He's been watching TV since 5:00."
,
"Он смотрит телевизор с 5:00."
],
[
"Ir's been raining all day."
,
"Весь день шел дождь."
],
[
"David has been in Canada for six months."
,
"Дэвид находится в Канаде уже шесть месяцев."
],
[
"We've been waiting for two hours."
,
"Мы ждали уже два часа."
],
[
"I've lived in Chicago for a long time."
,
"Я долгое время живу в Чикаго."
],
[
"David has been in Canada since January."
,
"Дэвид находится в Канаде с января."
],
[
"We've been waiting since 9:00."
,
"Мы ждем с 9:00."
],
[
"I've lived in Chicago since I was 10 years old."
,
"Я живу в Чикаго с 10 лет."
],
[
"Anna started her new job three weeks ago."
,
"Анна приступила к своей новой работе три недели назад."
],
[
"When did Tom leave? Ten minutes ago."
,
"Когда Том ушел? Десять минут назад."
],
[
"I had dinner an hour ago."
,
"Я ужинал час назад."
],
[
"Life was very different a hundred years ago."
,
"Сто лет назад жизнь была совсем другой."
],
[
"When did Rachel arrive in Brazil?"
,
"Когда Рэйчел приехала в Бразилию?"
],
[
"She arrived in Brazil three days ago."
,
"Она прибыла в Бразилию три дня назад."
],
[
"How long has she been in Brazil?"
,
"Как долго она находится в Бразилии?"
],
[
"She has been in Brazil for three days."
,
"Она в Бразилии три дня."
],
[
"Kate has made some coffee."
,
"Кейт приготовила кофе."
],
[
"I've decided to quit my job. / I decided to quit my job. Really? Why?"
,
"Я решил уйти с работы. / Я решил уйти с работы. Реально? Почему?"
],
[
"We've sold our car. Now we take the bus every day."
,
"Мы продали нашу машину. Теперь мы ездим на автобусе каждый день."
],
[
"They're having a party next week, but they haven't invited me."
,
"На следующей неделе у них вечеринка, но меня не пригласили."
],
[
"I'm looking for Amy. Have you seen her?"
,
"Я ищу Эми. Ты видел ее?"
],
[
"Her English has improved. It's pretty good now."
,
"Ее английский улучшился. Сейчас довольно хорошо."
],
[
"The city has changed a lot. It's very different now."
,
"Город сильно изменился. Сейчас все по-другому."
],
[
"They arrived yesterday."
,
"Они прибыли вчера."
],
[
"Where were you on Sunday?"
,
"Где ты был в воскресенье?"
],
[
"We didn't take a vacation last year."
,
"В прошлом году мы не брали отпуск."
],
[
"Did you go out last night? No, I stayed home."
,
"Вы выходили из дома вчера вечером? Нет, я остался дома."
],
[
"When did you sell your car?"
,
"Когда ты продал свою машину?"
],
[
"What time did Andy go out?"
,
"В котором часу Энди вышел?"
],
[
"Does James know that you're going away? No, I haven't told him yet."
,
"Джеймс знает, что ты уезжаешь? Нет, я ему еще не сказал."
],
[
"Have Sarah and Nick arrived yet? No, not yet, but they'll be here soon."
,
"Сара и Ник уже приехали? Нет, пока нет, но они скоро будут здесь."
],
[
"Has Nicole started her new job yet? / Did Nicole start her new job yet? No, she's starting next week."
,
"Николь уже приступила к своей новой работе? / Николь уже приступила к своей новой работе? Нет, она начнет на следующей неделе."
],
[
"Silvia has bought a new dress, but she hasn't worn it yet."
,
"Сильвия купила новое платье, но еще не надела его."
],
[
"The office is cleaned every day."
,
"В офисе убирают каждый день."
],
[
"The office was cleaned yesterday."
,
"Вчера офис был прибран."
],
[
"Butter is made from milk."
,
"Масло изготавливается из молока."
],
[
"Oranges are imported into Canada."
,
"Апельсины импортируются в Канаду."
],
[
"How ofcen are these rooms cleaned?"
,
"Как часто убираются эти номера?"
],
[
"I am never invited to parties."
,
"Меня никогда не приглашают на вечеринки."
],
[
"This house was built 100 years ago."
,
"Этот дом был построен 100 лет назад."
],
[
"These houses were built 100 years ago."
,
"Эти дома были построены 100 лет назад."
],
[
"When was the telephone invented?"
,
"Когда был изобретен телефон?"
],
[
"We weren't invited to the party last week."
,
"Нас не пригласили на вечеринку на прошлой неделе."
],
[
"Was anybody injured in the accident? Yes. two people were taken to the hospital"
,
"Кто-нибудь пострадал в результате несчастного случая? Да. два человека были доставлены в больницу"
],
[
"I was born in Colombia in 1995."
,
"Я родился в Колумбии в 1995 году."
],
[
"Where were you born? In Cairo."
,
"Где Вы родились? В Каире."
],
[
"The telephone was invented by Alexander Graham Bell in 1876."
,
"Телефон был изобретен Александром Грэмом Беллом в 1876 году."
],
[
"I was bitten by a dog a few days ago."
,
"Несколько дней назад меня укусила собака."
],
[
"Do you like these paintings? They were painted by a friend of mine."
,
"Вам нравятся эти картины? Их нарисовал мой друг."
],
[
"My car is at the garage. It is being repaired."
,
"Моя машина стоит в гараже. Его ремонтируют."
],
[
"Some new houses are being built across from the park."
,
"Напротив парка строятся новые дома."
],
[
"The office is being cleaned right now."
,
"В офисе сейчас проводится уборка."
],
[
"The office is cleaned every day."
,
"В офисе убирают каждый день."
],
[
"Football games are usually played on weekends, but no big games are being played next weekend."
,
"Футбольные матчи обычно проводятся по выходным, но в следующие выходные крупных игр не будет."
],
[
"My key has been stolen."
,
"Мой ключ украли."
],
[
"My keys have been stolen."
,
"Мои ключи украли."
],
[
"I'm not going to the party. I haven't been invited."
,
"Я не пойду на вечеринку. Меня не пригласили."
],
[
"Has this shirt been washed?"
,
"Эта рубашка была выстирана?"
],
[
"The room isn't dirty anymore. It has been cleaned."
,
"Комната больше не грязная. Она был очищен."
],
[
"The room was cleaned yesterday."
,
"Комната была убрана вчера."
],
[
"I can't find my keys. I think they've been stolen."
,
"Я не могу найти свои ключи. Я думаю, что их украли."
],
[
"My keys were stolen last week."
,
"Мои ключи украли на прошлой неделе."
]
]
