
[
[
"I want you to be happy."
,
"Я хочу, чтобы ты был счастлив."
],
[
"Would you like/Do you want me to lend you some money?"
,
"Хотите/Хотите, чтобы я одолжил вам немного денег?"
],
[
"They didn't want anybody to know their secret."
,
"Они не хотели, чтобы кто-нибудь узнал их секрет."
],
[
"Sue asked a friend to land her some money."
,
"Сью попросила подругу дать ей немного денег."
],
[
"I told you to be careful."
,
"Я говорил тебе быть осторожным."
],
[
"What do you advise me to do?"
,
"Что ты посоветуешь мне сделать?"
],
[
"I didn't expect them to be here."
,
"Я не ожидал, что они будут здесь."
],
[
"We persuaded Chris to come with us."
,
"Мы уговорили Криса поехать с нами."
],
[
"I'm teaching my brother to swim."
,
"Я учу своего брата плавать."
],
[
"Megan told me to wait for her."
,
"Меган сказала мне подождать ее."
],
[
"Nick told Sue not to wait for him."
,
"Ник сказал Сью не ждать его."
],
[
"He's very funny. He makes me laugh."
,
"Он очень забавный. Он меня смешит."
],
[
"At school our teacher made us work very hard."
,
"В школе наш учитель заставлял нас очень усердно работать."
],
[
"I didn't have my phone with me, so Sue let me use hers."
,
"У меня не было с собой телефона, поэтому Сью позволила мне воспользоваться ее."
],
[
"Why are you going out? To buy some bread."
,
"Почему ты уходишь? Чтобы купить хлеба."
],
[
"Amy went to the station to meet her friend."
,
"Эми пошла на вокзал, чтобы встретиться со своей подругой."
],
[
"Sue turned on the TV to watch the news."
,
"Сью включила телевизор, чтобы посмотреть новости."
],
[
"I'd like to go to Mexico to learn Spanish."
,
"Я хотел бы поехать в Мексику, чтобы выучить испанский язык."
],
[
"We need some money to buy food."
,
"Нам нужны деньги, чтобы купить еду."
],
[
"I don't have time to watch TV."
,
"У меня нет времени смотреть телевизор."
],
[
"I went to the store to get some fruit."
,
"Я пошел в магазин взять немного фруктов."
],
[
"They're going to Brazil to see their friends."
,
"Они собираются в Бразилию, чтобы увидеть своих друзей."
],
[
"We need some money to buy food. "
,
"Нам нужны деньги, чтобы купить еду."
],
[
"I went to the store for some fruit."
,
"Я пошел в магазин за фруктами."
],
[
"They're going to Brazil for a vacation."
,
"Они собираются в Бразилию на каникулы."
],
[
"We need some money for food."
,
"Нам нужны деньги на еду."
],
[
"Are you waiting for the doctor to come?"
,
"Вы ждете прихода врача?"
],
[
"What time do you usually go to work?"
,
"В какое время ты обычно идешь на работу?"
],
[
"I'm going to China next week."
,
"Я собираюсь в Китай на следующей неделе."
],
[
"Emma didn't want to go to the concert."
,
"Эмма не хотела идти на концерт."
],
[
"What time did you go to bed last night?"
,
"Во сколько ты вчера лег спать?"
],
[
"I went to the dentist yesterday."
,
"Вчера я ходил к стоматологу."
],
[
"I was very tired and went to sleep early."
,
"Я очень устал и рано лег спать."
],
[
"I'm going home now."
,
"Сейчас я иду домой."
],
[
"We're going on vacation next week."
,
"Мы собираемся в отпуск на следующей неделе."
],
[
"Children often go on school trips."
,
"Дети часто ездят на школьные экскурсии."
],
[
"When we were in Egypt, we went on a tour of the Pyramids."
,
"Когда мы были в Египте, мы отправились на экскурсию по пирамидам."
],
[
"Workers at the airport went on strike."
,
"Работники аэропорта объявили забастовку."
],
[
"Where's Anna? She went for a walk."
,
"Где Анна? Она пошла гулять."
],
[
"Do you go for a run every morning?"
,
"Вы ходите на пробежку каждое утро?"
],
[
"The water looks nice. I'm going for a swim."
,
"Вода кажется неплохой. Я собираюсь поплавать."
],
[
"Should we go out for dinner? I know a good restaurant."
,
"Должны ли мы пойти куда-нибудь поужинать? Я знаю хороший ресторан."
],
[
"Are you going shopping this afternoon?"
,
"Ты собираешься за покупками сегодня днем?"
],
[
"It's a nice day. Let's go swimming/ for a swim."
,
"Какой чудесный день. Пойдем купаться/поплавать."
],
[
"Richard has a small boat, and he often goes sailing."
,
"У Ричарда есть небольшая лодка, и он часто ходит под парусом."
],
[
"I went running before breakfast this morning."
,
"Сегодня утром я бегал перед завтраком."
]
]
