[
[
"Andrew is playing tennis tomorrow."
,
"Эндрю завтра играет в теннис."
],
[
"I'm not working next week."
,
"Я не работаю на следующей неделе."
],
[
"Sophie is going to the dentist on Friday."
,
"Софи собирается к дантисту в пятницу."
],
[
"We're having a party next weekend."
,
"У нас будет вечеринка на следующих выходных."
],
[
"Are you meeting your friends tonight?"
,
"Ты встречаешься со своими друзьями сегодня вечером?"
],
[
"What are you doing tomorrow night?"
,
"Что ты делаешь завтра вечером?"
],
[
"I'm not going out tonight. I'm staying home."
,
"Я не пойду сегодня вечером. Я остаюсь дома."
],
[
"I'm staying home tomorrow."
,
"Завтра я останусь дома."
],
[
"Are you going out tonight?"
,
"Ты собираешься куда-нибудь сегодня вечером?"
],
[
"Lisa isn't coming to the party next week."
,
"Лиза не придет на вечеринку на следующей неделе."
],
[
"Our plane arrives in New York at 7:30 tomorrow morning."
,
"Наш самолет прибывает в Нью-Йорк завтра утром в 7:30."
],
[
"What time does the movie end tonight?"
,
"Во сколько сегодня закончится фильм?"
],
[
"I'm going to a concert tomorrow."
,
"Завтра я иду на концерт."
],
[
"What time are you leaving?"
,
"В какое время вы уходите?"
],
[
"The concert starts at 7:30."
,
"Начало концерта в 7:30."
],
[
"What time does your plane leave?"
,
"Во сколько вылетает ваш самолет?"
],
[
"I'm going to buy some books tomorrow."
,
"Завтра я собираюсь купить несколько книг."
],
[
"Sarah is going to sell her car."
,
"Сара собирается продать свою машину."
],
[
"I'm not going to have breakfast this morning. I'm not hungry."
,
"Я не собираюсь завтракать сегодня утром. Я не голоден."
],
[
"What are you going to wear to the wedding next week?"
,
"Что ты собираешься надеть на свадьбу на следующей неделе?"
],
[
"Your hands are dirty. Yes, I know. I'm going to wash them."
,
"Твои руки грязные. Да, я знаю. Я собираюсь их помыть."
],
[
"Are you going to invite Matt to your party?"
,
"Ты собираешься пригласить Мэтта на свою вечеринку?"
],
[
"I am playing tennis with Julia tomorrow."
,
"Завтра я играю в теннис с Джулией."
],
[
"Look at the sky! It's going to rain."
,
"Посмотри на небо! Будет дождь."
],
[
"Oh, no! It's 9:00, and I'm not ready.I'm going to be late."
,
"О, нет! Сейчас 9:00, а я не готов. Я опоздаю."
],
[
"Sue travels a lot. Today she is in Los Angeles. Tomorrow she'll be in Mexico City. Next week she'll be in New York."
,
"Сью много путешествует. Сегодня она в Лос-Анджелесе. Завтра она будет в Мехико. На следующей неделе она будет в Нью-Йорке."
],
[
"Leave the old bread in the yard. The birds will eat it."
,
"Оставь старый хлеб во дворе. Птицы его съедят."
],
[
"We' ll probably go out tonight."
,
"Мы, вероятно, выйдем куда-нибудь сегодня вечером."
],
[
"I don't think it will rain this afternoon."
,
"Я не думаю, что сегодня днём будет дождь."
],
[
"Will you be home tomorrow morning?"
,
"Ты будешь дома завтра утром?"
],
[
"I won't be here tomorrow."
,
"Завтра меня здесь не будет."
],
[
"Don't drink coffee before you go to bed. You won't sleep well."
,
"Не пейте кофе перед сном. Ты не будешь спать спокойно."
],
[
"It's a nice day. I think I'll sit outside."
,
"Какой чудесный день. Думаю, я посижу снаружи."
],
[
"It's raining. I don't think I'll go out."
,
"Идет дождь. Я не думаю, что выйду."
],
[
"I think I'll go to bed early."
,
"Думаю, я лягу спать пораньше."
],
[
"We're going to the movies on Saturday. Do you want to come with us?"
,
"Мы идём в кино в субботу. Вы хотите пойти с нами?"
],
[
"I don't want my car anymore. I'm going to sell it."
,
"Мне больше не нужна моя машина. Я собираюсь продать его."
],
[
"Are you doing anything tomorrow night?"
,
"Ты делаешь что-нибудь завтра вечером?"
],
[
"I might go to the movies tonight, but I'm not sure."
,
"Я мог бы пойти в кино сегодня вечером, но я не уверен."
],
[
"When is Rebecca going to call you? I don't know. She might call this afternoon."
,
"Когда Ребекка позвонит тебе? Я не знаю. Она может позвонить сегодня днем."
],
[
"Take an umbrella with you. It might rain."
,
"Возьмите с собой зонтик. Может пойти дождь."
],
[
"Are you going out tonight? I might."
,
"Ты собираешься куда-нибудь сегодня вечером? Я мог бы."
],
[
"I might not go to work tomorrow."
,
"Возможно, завтра я не пойду на работу."
],
[
"Sue might not come to the party."
,
"Сью может не прийти на вечеринку."
],
[
"I may go to the movies tonight."
,
"Возможно, я пойду в кино сегодня вечером."
],
[
"Sue may not come to the party."
,
"Сью может не прийти на вечеринку."
],
[
"May I ask a question?"
,
"Могу я задать вопрос?"
],
[
"May I sit here? Sure."
,
"Можно мне посидеть здесь? Конечно."
],
[
"I can play the piano. My brother can play the piano, too."
,
"Я могу играть на пианино. Мой брат тоже умеет играть на фортепиано."
],
[
"Sarah can speak Italian, but she can't speak Spanish."
,
"Сара может говорить по-итальянски, но не говорит по-испански."
],
[
"Can you swim? Yes, but I'm not a very good swimmer."
,
"Вы умеете плавать? Да, но я не очень хороший пловец."
],
[
"Can you change a twenty-dollar bill? I'm sorry, I can't."
,
"Можно ли разменять двадцатидолларовую купюру? Извините, я не могу."
],
[
"I'm having a party next week, but Eric and Rachel can't come."
,
"На следующей неделе у меня вечеринка, но Эрик и Рэйчел не смогут прийти."
],
[
"When I was young, I could run very fast."
,
"Когда я был молод, я мог бегать очень быстро."
],
[
"Before Maria came to the United States, she couldn't understand much English. Now she can understand everything."
,
"До приезда в Соединенные Штаты Мария плохо понимала английский. Теперь она может все понять."
],
[
"I was tired last night, but I couldn't sleep."
,
"Вчера вечером я устал, но не мог заснуть."
],
[
"I had a party last week, but Eric and Rachel couldn't come."
,
"На прошлой неделе у меня была вечеринка, но Эрик и Рэйчел не смогли прийти."
],
[
"Can/Could you open the door, please?"
,
"Можете/не могли бы вы открыть дверь, пожалуйста?"
],
[
"Can/Could you wait a minute, please?"
,
"Можете/не могли бы вы подождать минутку, пожалуйста?"
],
[
"Can/Could I have a glass of water, please?"
,
"Можно/Можно мне стакан воды, пожалуйста?"
],
[
"Can I sit here?"
,
"Могу ли я здесь присесть?"
],
[
"Tom, could I borrow your umbrella?"
,
"Том, могу я одолжить твой зонтик?"
],
[
"It's evening, and you haven't eaten anything all day. You must be hungry."
,
"Наступил вечер, а ты весь день ничего не ел. Вы, должно быть, голодны."
],
[
"My brother has worked at your company for years. You must know him."
,
"Мой брат много лет работает в вашей компании. Вы должны знать его."
],
[
"My friends have che same zip code as you. They must live near you."
,
"У моих друзей такой же почтовый индекс, как и у вас. Они должны жить рядом с вами."
],
[
"This isn't John? I'm sorry. I must have che wrong number."
,
"Это не Джон? Мне жаль. Должно быть, я ошибся номером."
],
[
"The phone rang eight times, and Megan didn't answer. She must not have her phone with her."
,
"Телефон звонил восемь раз, но Меган не ответила. У нее не должно быть с собой телефона."
],
[
"Miguel takes the bus everywhere. He must not have a car."
,
"Мигель везде ездит на автобусе. У него не должно быть машины."
],
[
"The Silvas are always home on Fridays. They must not work then."
,
"По пятницам Сильвы всегда дома. Тогда они не должны работать."
],
[
"You must eat well if you want to be healthy."
,
"Вы должны хорошо питаться, если хотите быть здоровым."
],
[
"They're in a dangerous situation. They must be careful."
,
"Они в опасной ситуации. Они должны быть осторожны."
],
[
"Workers must wear safety glasses at this machine."
,
"Рабочие должны носить защитные очки при работе с этой машиной."
],
[
"In the United States, you must be 18 to vote."
,
"В Соединенных Штатах вам должно быть 18 лет, чтобы голосовать."
],
[
"You must have a passport to travel outside your country."
,
"Для выезда за пределы своей страны у вас должен быть паспорт."
],
[
"They were in a dangerous situation."
,
"Они оказались в опасной ситуации."
],
[
"They had to be careful."
,
"Им приходилось быть осторожными."
],
[
"We had to wear safety glasses when we visited the factory last week."
,
"Когда мы посетили завод на прошлой неделе, нам пришлось надеть защитные очки."
],
[
"Bicyclists must not ride on the sidewalk."
,
"Велосипедистам нельзя ездить по тротуару."
],
[
"You must not be late for school again!"
,
"Ты не должен снова опаздывать в школу!"
],
[
"Tom doesn't study enough. He should study harder."
,
"Том недостаточно учится. Ему следует учиться усерднее."
],
[
"It's a good movie. You should go and see it."
,
"Это хороший фильм. Вам следует пойти и посмотреть это."
],
[
"When you play tennis, you should always watch the ball."
,
"Когда вы играете в теннис, вы всегда должны следить за мячом."
],
[
"Tom shouldn't go to bed so late."
,
"Тому не следует ложиться спать так поздно."
],
[
"You watch TV all the time. You shouldn't watch TV so much."
,
"Ты все время смотришь телевизор. Тебе не следует так много смотреть телевизор."
],
[
"I think Rachel should buy some new clothes."
,
"Я думаю, Рэйчел стоит купить новую одежду."
],
[
"It's late. I think I should go home now."
,
"Уже поздно. Думаю, мне пора идти домой."
],
[
"I don't think you should work so hard."
,
"Я не думаю, что тебе стоит так много работать."
],
[
"Do you think I should buy rhis hat?"
,
"Как думаешь, мне стоит купить эту шляпу?"
],
[
"I should study tonight, but I think I'll go to the movies."
,
"Мне нужно поучиться сегодня вечером, но я думаю, что пойду в кино."
],
[
"I have to study tonight. I can't go to the movies."
,
"Мне нужно учиться сегодня вечером. Я не могу пойти в кино."
],
[
"It's very warm in this room. Should I open the window?"
,
"В этой комнате очень тепло. Должен ли я открыть окно?"
],
[
"Should/Shall I call you tonight?"
,
"Должен ли я позвонить тебе сегодня вечером?"
],
[
"It's a nice day. Should/Shall we go for a walk?"
,
"Какой чудесный день. Стоит/должны ли мы пойти на прогулку?"
],
[
"What should we have for dinner?"
,
"Что нам следует съесть на ужин?"
],
[
"I'll be late for work tomorrow. I have to go to the dentist."
,
"Завтра я опоздаю на работу. Мне нужно пойти к дантисту."
],
[
"Megan starts work at 7:00, so she has to get up at 6:00."
,
"Меган начинает работать в 7:00, поэтому ей нужно вставать в 6:00."
],
[
"You have to pass a test before you can get a driver's license."
,
"Прежде чем получить водительские права, вам необходимо пройти тест."
],
[
"I was late for work yesterday. I had to go to the dentist."
,
"Вчера я опоздал на работу. Мне пришлось пойти к дантисту."
],
[
"We had to walk home last night. There were no buses."
,
"Вчера вечером нам пришлось идти домой пешком. Автобусов не было."
],
[
"What time do you have to go to the dentist tomorrow?"
,
"Во сколько тебе завтра идти к стоматологу?"
],
[
"Does Megan have to work on Saturdays?"
,
"Меган должна работать по субботам?"
],
[
"Why did they have to leave the party early?"
,
"Почему им пришлось уйти с вечеринки раньше времени?"
],
[
"I' m not working tomorrow, so I don't have to get up early."
,
"Завтра я не работаю, поэтому мне не придется рано вставать."
],
[
"Mike doesn't have to work very hard He's got an easy job."
,
"Майку не нужно много работать. У него легкая работа."
],
[
"We didn't have to wait very long for the bus - it came in a few minutes."
,
"Автобус нам не пришлось долго ждать – он пришел через несколько минут."
]
]
