
[
[
"Every country has a national flag. / All countries have a national flag."
,
"У каждой страны есть национальный флаг. / У всех стран есть национальный флаг."
],
[
"It rained every day last week."
,
"На прошлой неделе каждый день шел дождь."
],
[
"It rained all day yesterday."
,
"Вчера весь день шел дождь."
],
[
"Do you have everything you need?"
,
"У вас есть все, что вам нужно?"
],
[
"Everybody needs friends."
,
"Всем нужны друзья."
],
[
"I lost my watch. I've looked everywhere for it."
,
"Я потерял часы. Я искал его повсюду."
],
[
"Everybody has problems."
,
"У всех есть проблемы."
],
[
"Most children like to play."
,
"Большинство детей любят играть."
],
[
"I don't want any money."
,
"Я не хочу никаких денег."
],
[
"Some books are better than others."
,
"Некоторые книги лучше других."
],
[
"Most people drive too fast."
,
"Большинство людей водят слишком быстро."
],
[
"Some birds can't fly."
,
"Некоторые птицы не умеют летать."
],
[
"I don't want any of this money."
,
"Мне не нужны эти деньги."
],
[
"Most of the children at this school are under 11 years old."
,
"Большинству детей в этой школе меньше 11 лет."
],
[
"Some of these books are very old."
,
"Некоторые из этих книг очень старые."
],
[
"None of my friends live near me."
,
"Никто из моих друзей не живет рядом со мной."
],
[
"All (of) the students in our class passed the exam."
,
"Все (из) учеников нашего класса сдали экзамен."
],
[
"Ana has lived in Miami all (of) her life."
,
"Ана прожила в Майами всю свою жизнь."
],
[
"You can have some of this cake, but not all of it."
,
"Вы можете съесть часть этого торта, но не весь."
],
[
"Do you know those people? Most of them, but not all of them."
,
"Вы знаете этих людей? Большинство из них, но не все."
],
[
"Some of us are going out tonight. Why don't you come with us?"
,
"Некоторые из нас сегодня вечером собираются куда-нибудь пойти. Почему бы тебе не пойти с нами?"
],
[
"I have a lot of books, but I haven't read any of them."
,
"У меня много книг, но я не читал ни одну из них."
],
[
"How many of these books have you read? None of them."
,
"Сколько из этих книг вы прочитали? Ни один из них."
],
[
"Rebecca has two children. Both are married."
,
"У Ребекки двое детей. Оба женаты."
],
[
"Would you like tea or coffee? You can have either."
,
"Хотите чай или кофе? Вы можете иметь и то, и другое."
],
[
"Do you want to go to the movies or the theater? Neither. I want to stay home."
,
"Хотите пойти в кино или театр? Ни один. Я хочу остаться дома."
],
[
"Last year I went to Miami and Seattle. I liked both cities very much."
,
"В прошлом году я побывал в Майами и Сиэтле. Оба города мне очень понравились."
],
[
"First I worked in an office, and later in a store. Neither job was very interesting."
,
"Сначала я работал в офисе, а потом в магазине. Ни одна работа не была очень интересной."
],
[
"There are two ways to get to the airport. You can go either way."
,
"Есть два способа добраться до аэропорта. Вы можете пойти в любом направлении."
],
[
"Neither of my parents is Canadian."
,
"Ни один из моих родителей не канадец."
],
[
"I haven't read either of these books."
,
"Я не читал ни одну из этих книг.(2 books)"
],
[
"I like both (of) those pictures."
,
"Мне нравятся обе эти фотографии."
],
[
"Both (of) Paul's sisters are married."
,
"Обе сестры Пола замужем."
],
[
"Neither of Paul's sisters is married."
,
"Ни одна из сестер Пола не замужем.(2 sisters)"
],
[
"Paul has two sisters. Both of them are married."
,
"У Пола есть две сестры. Они оба женаты."
],
[
"Sue and I didn't eat anything. Neither of us was hungry."
,
"Мы со Сью ничего не ели. Никто из нас не был голоден."
],
[
"Who are those two people? I don't know either of them."
,
"Кто эти два человека? Я не знаю ни одного из них."
]
]
