
[
[
"There was a train at 11:00."
,
"Это был поезд в 11:00."
],
[
"There were 1,250 rooms."
,
"Там было 1250 комнат."
],
[
"Were there any problems?"
,
"Были ли проблемы?"
],
[
"I was hungry when I got home, but there wasn't anything to eat."
,
"Когда я вернулся домой, я был голоден, но есть было нечего."
],
[
"There's been an accident."
,
"Произошел несчастный случай."
],
[
"There have been a lot of accidents."
,
"Произошло много несчастных случаев."
],
[
"Do you think there will be a lot of people at the party on Saturday?"
,
"Как вы думаете, на вечеринке в субботу будет много людей?"
],
[
"The president of the company is leaving, so there will be a new president soon."
,
"Президент компании уходит, поэтому скоро будет новый президент."
],
[
"I'm going out of town tomorrow. I'm packing my things today because there won't be time tomorrow."
,
"Завтра я уезжаю из города. Сегодня я собираю вещи, потому что завтра не будет времени."
],
[
"What time is it?"
,
"Который сейчас час?"
],
[
"What day is it?"
,
"Какой это день?"
],
[
"It was my birthday yesterday."
,
"Вчера у меня был день рождения."
],
[
"It's two miles from our house to downtown."
,
"От нашего дома до центра города две мили."
],
[
"How far is it from New York to Los Angeles?"
,
"На каком расстоянии Нью-Йорк от Лос-Анджелеса?"
],
[
"It's a long way from here to the airport."
,
"Отсюда до аэропорта далеко."
],
[
"We can walk home. It isn't far."
,
"Мы можем пойти домой. Это недалеко."
],
[
"It's nice to see you again."
,
"Приятно видеть Вас снова."
],
[
"It's impossible to understand her."
,
"Ее невозможно понять."
],
[
"It wasn't easy to find your house."
,
"Найти твой дом было нелегко."
],
[
"Is it true that you're moving to Dallas?"
,
"Это правда, что ты переезжаешь в Даллас?"
],
[
"You're late. I am? I'm sorry."
,
"Ты опоздал. Я? Мне жаль."
],
[
"I was sick last week. You were? I didn't know that."
,
"Я болел на прошлой неделе. *Ты болел? Я этого не знал."
],
[
"It's raining again. It is? It was sunny 10 minutes ago."
,
"Опять идет дождь. *Дождь? 10 минут назад было солнечно."
],
[
"There's a problem with the car. There is? What's wrong with it?"
,
"Есть проблема с машиной. *Проблема? Что с этим не так?"
],
[
"Bill can't drive. He can't? I didn't know that."
,
"Билл не умеет водить машину. *Он не умеет? Я этого не знал."
],
[
"I'm not hungry. You aren't? I am."
,
"Я не голоден. *Не голоден? *Не голоден."
],
[
"Sue isn't at work today. She isn't? Is she sick?"
,
"Сью сегодня не на работе. *Не на работе? Она болеет?"
],
[
"I speak four languages. You do? Which ones?"
,
"Я говорю на четырех языках. *На четырех? А на каких?"
],
[
"Tim doesn't eat meat. He doesn't? Does he eat fish?"
,
"Тим не ест мясо. *Не ест? Он ест рыбу?"
],
[
"Nicole got married last week. She did? Really?"
,
"Николь вышла замуж на прошлой неделе. *Вышла замуж? Действительно?"
],
[
"It's a nice day, isn't it? Yes, it's perfect."
,
"Это хороший день, не так ли? Да, это идеально."
],
[
"Anna lives in Portland, doesn't she? Yes, that's right."
,
"Анна живет в Портленде, не так ли? Да все верно."
],
[
"You closed the window, didn't you? Yes, I think so."
,
"Ты закрыл окно, не так ли? Да, я так думаю."
],
[
"Those shoes are nice, aren't they? Yes, very nice."
,
"Эти туфли хороши, не так ли? Да, очень мило."
],
[
"Tom will be here soon, won't he? Yes, probably."
,
"Том скоро будет здесь, не так ли? Да, возможно."
],
[
"That isn't your car, is it? No, it's my mother's."
,
"Это не твоя машина, не так ли? Нет, это моей матери."
],
[
"You haven't met my mother, have you? No, I haven't."
,
"Ты не знаком с моей матерью, не так ли? Нет, я не знаком."
],
[
"Emily doesn't go out much, does she? No, she doesn't."
,
"Эмили мало гуляет, не так ли? Нет, она не гуляет."
],
[
"You won't be late, will you? No, I'm never late."
,
"Ты не опоздаешь, не так ли? Нет, я никогда не опаздываю."
]
]
