
[
[
"She doesn't drink coffee."
,
"Она не пьет кофе."
],
[
"He doesn't like his job."
,
"Ему не нравится его работа."
],
[
"I drink coffee, but I don't drink tea."
,
"Я пью кофе, но не пью чай."
],
[
"Sue drinks tea, but she doesn't drink coffee."
,
"Сью пьет чай, но не пьет кофе."
],
[
"You don't work very hard."
,
"Вы не очень много работаете."
],
[
"We don't watch TV very often."
,
"Мы не очень часто смотрим телевизор."
],
[
"The weather is usually nice. It doesn't rain very often."
,
"Погода обычно хорошая. Дождь идет не очень часто."
],
[
"Matt and Nicole don't know many people."
,
"Мэтт и Николь мало кого знают."
],
[
"I don't like football."
,
"Я не люблю футбол."
],
[
"He doesn't like football."
,
"Он не любит футбол."
],
[
"I don't like Josh, and Josh doesn't like me."
,
"Мне не нравится Джош, и Джош не любит меня."
],
[
"My car doesn't use much gas."
,
"Моя машина не потребляет много бензина."
],
[
"Sometimes he is late, but it doesn't happen very often."
,
"Иногда он опаздывает, но это случается не очень часто."
],
[
"I don't like to wash the car. I don't do it very often."
,
"Я не люблю мыть машину. Я делаю это не очень часто."
],
[
"Sarah speaks Spanish, but she doesn't speak Italian."
,
"Сара говорит по-испански, но не говорит по-итальянски."
],
[
"Bill doesn't do his job very well."
,
"Билл не очень хорошо справляется со своей работой."
],
[
"Maria doesn't usually have breakfast."
,
"Мария обычно не завтракает."
],
[
"What do you do? I work in a bank."
,
"Что вы делаете? Я работаю в банке."
],
[
"Do you play the guitar? No, I don't."
,
"Ты играешь на гитаре? Нет."
],
[
"Do your parents speak English? Yes, they do."
,
"Твои родители говорят по-английски? Да."
],
[
"Does Ryan work hard? Yes, he does."
,
"Райан много работает? Да."
],
[
"Does your sister live in Vancouver? No, she doesn't."
,
"Твоя сестра живет в Ванкувере? Нет."
],
[
"Tom is taking a shower at the moment."
,
"Том сейчас принимает душ."
],
[
"Take an umbrella with you. It's raining."
,
"Возьмите с собой зонтик. Идет дождь."
],
[
"You can turn off the TV. I'm not watching it."
,
"Вы можете выключить телевизор. Я не смотрю это."
],
[
"Why are you under the table? What are you doing?"
,
"Почему ты под столом? Что ты делаешь?"
],
[
"I work every day from 9:00 to 5:30."
,
"Я работаю каждый день с 9:00 до 5:30."
],
[
"Tom takes a shower every morning."
,
"Том принимает душ каждое утро."
],
[
"It rains a lot there in the winter."
,
"Зимой там часто идут дожди."
],
[
"I don't watch TV very often."
,
"Я не смотрю телевизор очень часто."
],
[
"What do you usually do on weekends?"
,
"Что ты обычно делаешь на выходных?"
],
[
"I'm tired I want to go home."
,
"Я устал, хочу домой."
],
[
"Do you know that girl? Yes, but I don't remember her name."
,
"Ты знаешь эту девушку? Да, но я не помню ее имени."
],
[
"I don't understand. What do you mean?"
,
"Я не понимаю. Что ты имеешь в виду?"
],
[
"I have blue eyes."
,
"У меня голубые глаза."
],
[
"Tom has two sisters."
,
"У Тома есть две сестры."
],
[
"Our car has four doors."
,
"У нашей машины четыре двери."
],
[
"Sarah isn't feeling well. She has a headache."
,
"Сара плохо себя чувствует. У нее болит голова."
],
[
"They like animals. They have a horse, three dogs, and six cats."
,
"Они любят животных. У них есть лошадь, три собаки и шесть кошек."
],
[
"I don't have a car."
,
"У меня нет машины."
],
[
"They don't have any children."
,
"У них нет детей."
],
[
"It's a nice house, but it doesn't have a garage."
,
"Это хороший дом, но у него нет гаража."
],
[
"Mariko doesn't have a job right now."
,
"У Марико сейчас нет работы."
],
[
"Do you have a camera? No, I don't."
,
"У вас есть камера? Нет."
],
[
"Does Jennifer have a car? Yes, she does."
,
"У Дженнифер есть машина? Да."
],
[
"What kind of car does she have?"
,
"Какая у нее машина?"
],
[
"How many children do they have?"
,
"Сколько у них детей?"
],
[
"I was tired last night."
,
"Я устал прошлой ночью."
],
[
"Where was Kate yesterday?"
,
"Где была Кейт вчера?"
],
[
"The weather was nice last week."
,
"На прошлой неделе погода была хорошая."
],
[
"You were late yesterday."
,
"Ты опоздал вчера."
],
[
"They weren't here last Sunday."
,
"Их не было здесь в прошлое воскресенье."
],
[
"Last year Rachel was 22, so she is 23 now."
,
"В прошлом году Рэйчел было 22, сейчас ей 23."
],
[
"When I was a child, I was scared of dogs."
,
"В детстве я боялся собак."
],
[
"We were hungry after the trip, but we weren't tired."
,
"После поездки мы проголодались, но не устали."
],
[
"The hotel was comfortable, but it wasn't expensive."
,
"Отель был комфортабельным, но не дорогим."
],
[
"Was the weather nice when you were on vacation?"
,
"Была ли хорошая погода, когда вы были в отпуске?"
],
[
"Your shoes are nice. Were they expensive?"
,
"Твои туфли хороши. Были ли они дорогими?"
],
[
"Why were you late this morning?"
,
"Почему ты опоздал сегодня утром?"
],
[
"Were you late? No, I wasn't."
,
"Ты опоздал? Нет."
],
[
"Was Tom at work yesterday? Yes, he was."
,
"Том был на работе вчера? Да."
],
[
"Were Sue and Jim at the party? No, they weren't."
,
"Сью и Джим были на вечеринке? Нет."
],
[
"They watched TV last night."
,
"Вчера вечером они смотрели телевизор."
],
[
"Tony worked in a bank from 2005 to 2011."
,
"Тони работал в банке с 2005 по 2011 год."
],
[
"Yesterday it rained all morning. It stopped at lunchtime."
,
"Вчера все утро шел дождь. Это прекратилось во время обеда."
],
[
"Is Tom herer? No, he just left."
,
"Том здесь? Нет, он только ушел."
],
[
"I'm not hungry. I just had dinner."
,
"Я не голоден. Я только поужинал."
],
[
"I usually get up early, but this morning I got up at 9:30."
,
"Обычно я встаю рано, но сегодня утром я встал в 9:30."
],
[
"We did a lot of work yesterday."
,
"Вчера мы проделали большую работу."
],
[
"Megan went to the movies three times last week."
,
"Меган трижды ходила в кино на прошлой неделе."
],
[
"James came into the room, took off his coat, and sat down."
,
"Джеймс вошел в комнату, снял пальто и сел."
],
[
"I don't watch TV very often."
,
"Я не смотрю телевизор очень часто."
],
[
"I didn't watch TV yesterday."
,
"Я не смотрел телевизор вчера."
],
[
"Does she go out often?"
,
"Она часто выходит из дома?"
],
[
"Did she go out last night?"
,
"Она выходила вчера вечером?"
],
[
"I played tennis yesterday, but I didn't win."
,
"Вчера я играл в теннис, но не выиграл."
],
[
"Did you do your homework? No, I didn't have time."
,
"Ты сделал домашнее задание? Нет, у меня не было времени."
],
[
"We went to a nice restaurant, but we didn't enjoy the meal."
,
"Мы пошли в хороший ресторан, но еда нам не понравилась."
],
[
"Did you see Joe yesterday? No, I didn't."
,
"Ты видел Джо вчера? Нет."
],
[
"Did it rain on Sunday? Yes, it did."
,
"В воскресенье шел дождь? Да."
],
[
"What were you doing at 11:30 yesterday? Were you working?"
,
"Что ты делал вчера в 11:30? Где ты работаешь?"
],
[
"What did he say? I don't know. I wasn't listening."
,
"Что он сказал? Я не знаю. Я не слушал."
],
[
"It was raining. so we didn't go out."
,
"Шел дождь. поэтому мы не вышли."
],
[
"In 2009 we were living in Japan."
,
"В 2009 году мы жили в Японии."
],
[
"I was working ar 10:30 last night."
,
"Вчера вечером я работал в 10:30."
],
[
"It wasn't raining when we went out."
,
"Когда мы вышли, дождя не было."
],
[
"Whar were you doing at 3:00?"
,
"Что ты делал в 3:00?"
],
[
"What happened?"
,
"Что случилось?"
],
[
"What was Jack doing when his phone rang?"
,
"Что делал Джек, когда зазвонил его телефон?"
],
[
"He was reading a book."
,
"Он читал книгу."
],
[
"What did he do when his phone rang?"
,
"Что он сделал, когда зазвонил его телефон?"
],
[
"He stopped reading and answered his phone."
,
"Он прекратил читать и ответил на звонок."
],
[
"Did you watch the game on TV last night?"
,
"Ты смотрел игру по телевизору вчера вечером?"
],
[
"It didn't rain while we were on vacation."
,
"Пока мы были в отпуске, дождя не было."
],
[
"It wasn't raining when I got up."
,
"Когда я встал, дождя не было."
],
[
"I started work at 9:00 and finished at 4:30. At 2:30 I was working."
,
"Я начал работу в 9:00 и закончил в 4:30. В 2:30 я работал."
],
[
"It was raining when we went out."
,
"Когда мы вышли, шел дождь."
],
[
"I saw Emily and Sam this morning. They were waiting at the bus stop."
,
"Сегодня утром я видел Эмили и Сэма. Они ждали на автобусной остановке."
],
[
"Grace fell asleep while she was reading."
,
"Грейс уснула, пока читала."
]
]
