
[
[
"a sales chart"
,
"график продаж"
],
[
"The documentary charted the progress of the war."
,
"В документальном фильме показан ход войны."
],
[
"Can you help me? Of course (not)!"
,
"Вы можете помочь мне? Конечно (нет)!"
],
[
"She did a ten-week course in computing."
,
"Она прошла десятинедельный курс информатики."
],
[
"a three-course dinner"
,
"ужин из трёх блюд"
],
[
"a golf course"
,
"поле для гольфа"
],
[
"In the course of the interview she mentioned her previous experience."
,
"В ходе интервью она рассказала о своем предыдущем опыте."
],
[
"His English will improve in the course of time."
,
"Его английский улучшится с течением времени."
],
[
"In this article, the above topics are further studied. "
,
"В данной статье вышеуказанные темы дополнительно изучаются."
],
[
"Where have you put the keys?"
,
"Куда ты положил ключи?"
],
[
"This puts me in a very difficult position."
,
"Это ставит меня в очень трудное положение."
],
[
"I don't know quite how to put this, but I'm leaving."
,
"Я не знаю, как это сказать, но я ухожу."
],
[
"Please put your name on the list by Monday evening."
,
"Пожалуйста, внесите свое имя в список до вечера понедельника."
],
[
"I always take my mobile phone with me."
,
"Я всегда беру с собой мобильный телефон."
],
[
"I took the kids to the park."
,
"Я повел детей в парк."
],
[
"Someone's taken my coat."
,
"Кто-то забрал мое пальто."
],
[
"He reached across and took the glass from her."
,
"Он протянул руку и взял у нее стакан."
],
[
"So, are you going to take the job?"
,
"Итак, ты собираешься принять эту работу?"
],
[
"It's taken me three days to get here."
,
"Мне потребовалось три дня, чтобы добраться сюда."
],
[
"Take two tablets, three times a day."
,
"Принимайте по две таблетки три раза в день."
],
[
"Have you taken her temperature?"
,
"Ты измерил ей температуру?"
],
[
"I take a size 12 in trousers."
,
"Я беру брюки 12 размерa."
],
[
"There's six of us and the car only takes five."
,
"Нас шестеро, а машина вмещает только пятерых."
],
[
"Are you taking the train to Edinburgh?"
,
"Ты едешь на поезде в Эдинбург?"
],
[
"If you're tired, take a rest."
,
"Если вы устали, отдохните."
],
[
"I take great pleasure in cooking."
,
"Я получаю огромное удовольствие от готовки."
],
[
"Take a look at these photos."
,
"Взгляните на эти фотографии."
],
[
"Whatever I say she'll take it the wrong way."
,
"Что бы я ни сказал, она поймет это неправильно."
],
[
"I take it you're not coming with us."
,
"Я так понимаю, ты не пойдешь с нами."
],
[
"We argue all the time - I really can't take it any more."
,
"Мы все время ссоримся – я правда больше не могу."
],
[
"You could be doing a much less interesting job, take it from me."
,
"Поверьте мне, вы могли бы заниматься гораздо менее интересной работой."
],
[
"With an illness like this you just have to take every day as it comes."
,
"При такой болезни нужно просто принимать каждый день таким, какой он есть."
],
[
"By morning they had taken the city."
,
"К утру они взяли город."
],
[
"I need to get some bread on the way home."
,
"Мне нужно купить немного хлеба по дороге домой."
],
[
"Wait here while I get the car."
,
"Подожди здесь, пока я заберу машину."
],
[
"Guy still hasn't got my email yet."
,
"Парень до сих пор не получил мое письмо."
],
[
"He never gets any of my jokes."
,
"Он никогда не понимает моих шуток."
],
[
"Get over here right now!"
,
"Иди сюда прямо сейчас!"
],
[
"Could you get that bowl down from the shelf for me?"
,
"Не мог бы ты снять для меня эту миску с полки?"
],
[
"What time do you normally get home from work?"
,
"В какое время вы обычно приходите домой с работы?"
],
[
"We might be able to get dad to pay."
,
"Возможно, мы можем заставить отца заплатить."
],
[
"I never get to sit in the front seat."
,
"Мне никогда не давали сесть на переднее сиденье."
],
[
"We should go. It's getting late."
,
"Мы должны идти. Становится поздно."
],
[
"I need to get my hair cut."
,
"Мне нужно подстричься."
],
[
"I feel like I'm getting a cold."
,
"Я чувствую так будто скоро простыну ."
],
[
"Maybe we should get a taxi home."
,
"Может, нам стоит взять такси домой."
],
[
"Can you get the phone?"
,
"Можешь взять(ответить на) телефон?"
]
]
