[
[
"He was getting bored doing the same thing every day."
,
"Ему стало скучно делать одно и то же каждый день."
],
[
"I am beginning to get bored with eating salad."
,
"Мне начинает надоедать есть салат."
],
[
"There was a bored expression on her face."
,
"На ее лице было скучающее выражение."
],
[
"Thirty bored students looked back at me."
,
"Тридцать скучающих студентов оглянулись на меня."
],
[
"It was a cold, wet day and the children were bored."
,
"День был холодный и дождливый, и детям было скучно."
],
[
"a jazz/rock band"
,
"джаз/рок-группа"
],
[
"The Beatles were probably the most famous band in the world."
,
"The Beatles были, пожалуй, самой известной группой в мире."
],
[
"a wrist band"
,
"браслет на запястье"
],
[
"a red silk band"
,
"красная шелковая лента"
],
[
"The former president still has a small band of supporters."
,
"У бывшего президента все еще есть небольшая группа сторонников."
],
[
"In the late 1880s, five Indian bands lived along the San Luis Rey River."
,
"В конце 1880-х годов вдоль реки Сан-Луис-Рей жили пять индейских племен."
],
[
"We banded the birds (= put bands around their legs) so that we could identify them later."
,
"Мы окольцевали птиц (= обмотали их ноги повязками), чтобы потом можно было их идентифицировать."
],
[
"Most of our employees are within the lower age band."
,
"Большинство наших сотрудников находятся в младшей возрастной группе."
],
[
"an electricity/gas/phone bill"
,
"счет за электричество/газ/телефон"
],
[
"When a bill is passed in Parliament, it becomes law."
,
"Когда законопроект принят парламентом, он становится законом."
],
[
"a dollar/one-dollar bill"
,
"доллар/однодолларовая купюра"
],
[
"This will be the actor's 22nd year heading the bill at the Theatre Royal, York."
,
"Это будет 22-й год, когда актер возглавляет программу Королевского театра в Йорке."
],
[
"The film was billed as a romantic comedy."
,
"Фильм был заявлен как романтическая комедия."
],
[
"Please bill me for any expenses you incur."
,
"Пожалуйста, выставьте мне счет за любые расходы, которые вы понесете."
],
[
"Could we have the bill please?"
,
"Можем ли мы получить счет, пожалуйста?"
],
[
"She was a very dear friend."
,
"Она была очень дорогим другом."
],
[
"He was very dear to me."
,
"Он был мне очень дорог."
],
[
"Annie's such a dear - she's brought me breakfast in bed every morning this week."
,
"Энни такая милая, каждое утро на этой неделе она приносила мне завтрак в постель."
],
[
"an office/school desk"
,
"офис/учебная парта"
],
[
"We finished painting upstairs yesterday, but the downstairs still needs some work."
,
"Вчера мы закончили красить верхний этаж, но нижний этаж еще требует доработки."
],
[
"an ear of corn"
,
"початок кукурузы"
],
[
"The hearing in my left ear isn't so good."
,
"Слух на левое ухо не очень хороший."
],
[
"a hard-boiled/soft-boiled egg"
,
"яйцо, сваренное вкрутую/всмятку"
],
[
"How do you like your eggs - fried or boiled?"
,
"Какие яйца вы любите – жареные или вареные?"
],
[
"An excited crowd waited for the singer to arrive."
,
"Взволнованная толпа ждала приезда певца."
],
[
"Are you getting excited about your holiday?"
,
"Вы в восторге от отпуска?"
],
[
"an exciting movie/soundtrack"
,
"захватывающий фильм/саундтрек"
],
[
"It was a really exciting match."
,
"Это был действительно захватывающий матч."
],
[
"Has the post come/arrived yet?"
,
"Посылка уже пришла/дошла?"
],
[
"My letter must have got lost in the post."
,
"Должно быть, мое письмо затерялось на почте."
],
[
"Teaching posts are advertised in Tuesday's edition of the paper."
,
"Объявления о преподавательских должностях публикуются в выпуске газеты во вторник."
],
[
"a lamppost"
,
"фонарный столб"
],
[
"a signpost"
,
"указатель"
],
[
"Did you remember to post my letter?"
,
"Ты вспомнил отправить мое письмо?"
],
[
"I never post anything on the Internet that I wouldn't want my boss to see."
,
"Я никогда не публикую в Интернете ничего такого, чего бы не хотел, чтобы мой начальник увидел."
],
[
"She has agreed to post bail for her brother."
,
"Она согласилась внести залог за своего брата."
],
[
"She's very possessive about her toys and finds it hard to share."
,
"Она очень собственнически относится к своим игрушкам, и ей трудно ими поделиться."
],
[
"Bill and I shared an office for years."
,
"Мы с Биллом жили в одном офисе много лет."
],
[
"We share an interest in sailing."
,
"Мы разделяем интерес к парусному спорту."
],
[
"She's not doing her share of the work."
,
"Она не выполняет свою часть работы."
],
[
"We must all accept some share of the responsibility."
,
"Мы все должны принять на себя некоторую долю ответственности."
],
[
"I need a new pair of trousers to go with this jacket."
,
"Мне нужна новая пара брюк к этой куртке."
],
[
"The plane climbed quickly to a height of 30,000 feet."
,
"Самолет быстро поднялся на высоту 30 000 футов."
],
[
"I hate climbing ladders."
,
"Я ненавижу подниматься по лестницам."
],
[
"Our costs have climbed rapidly in the last few years."
,
"За последние несколько лет наши расходы быстро выросли."
],
[
"Roll out the pastry on a flat surface."
,
"Раскатайте тесто на ровной поверхности."
],
[
"a furnished/unfurnished flat"
,
"меблированная/немеблированная квартира"
],
[
"The two situations are quite different."
,
"Эти две ситуации совершенно разные."
],
[
"The colors almost match but not quite."
,
"Цвета почти совпадают, но не совсем."
],
[
"I’m not quite done yet."
,
"Я еще не совсем закончил."
],
[
"I’m not quite sure I understand."
,
"Я не совсем уверен, что понимаю."
],
[
"Winning this contest was quite an accomplishment."
,
"Победа в этом конкурсе стала большим достижением."
],
[
"It was quite a remarkable speech."
,
"Это была весьма примечательная речь."
]
]
