
[
[
"You won't find a better plumber anywhere in England."
,
"Лучшего сантехника вы не найдете нигде в Англии."
],
[
"I can't find my keys anywhere."
,
"Я нигде не могу найти свои ключи."
],
[
"Is there anywhere in particular you wanted to go to eat tonight?"
,
"Есть ли конкретное место, куда вам хотелось пойти сегодня вечером?"
],
[
"Did you go anywhere interesting this summer?"
,
"Вы бывали где-нибудь интересным этим летом?"
],
[
"Is there anywhere to eat around here?"
,
"Здесь есть где поесть?"
],
[
"Smoking is not permitted anywhere in this theater."
,
"Курение запрещено нигде в этом театре."
],
[
"I've lost my glasses and I can't find them anywhere."
,
"Я потерял свои очки и нигде не могу их найти."
],
[
"Have you seen the remote control for the TV anywhere?"
,
"Вы где-нибудь видели пульт от телевизора?"
],
[
"I can’t find my scarf anywhere."
,
"Я нигде не могу найти свой шарф."
],
[
"There are no reserved seats – just sit anywhere you like."
,
"Здесь нет плацкарт – садитесь где хотите."
],
[
"It was his first appearance on television/television appearance as president."
,
"Это было его первое появление на телевидении/выступление на телевидении в качестве президента."
],
[
"This was the defendant's third court appearance for the same offence."
,
"Это была третья явка обвиняемого в суд за одно и то же преступление."
],
[
"He made his first stage/TV appearance at the age of six."
,
"Он впервые появился на сцене и на телевидении в возрасте шести лет."
],
[
"I didn't really want to go to the party, but I thought I'd better put in an appearance."
,
"Мне не очень-то хотелось идти на вечеринку, но я подумал, что лучше показаться."
],
[
"Madonna made a guest appearance at the concert."
,
"Мадонна выступила на концерте в качестве гостя."
],
[
"The endless public appearances are an inevitable part of an election campaign."
,
"Бесконечные публичные выступления — неизбежная часть избирательной кампании."
],
[
"a middle-aged man of smart appearance"
,
"мужчина средних лет, элегантной внешности"
],
[
"You can alter/change the whole appearance of a room just by lighting it in a certain way."
,
"Вы можете изменить весь внешний вид комнаты, просто осветив ее определенным образом."
],
[
"There was nothing unusual about/in her physical appearance."
,
"В ее внешности не было ничего необычного."
],
[
"Appearances can be deceptive."
,
"Внешность может быть обманчивой."
],
[
"He was a far more complicated man than outward appearances suggested."
,
"Он был гораздо более сложным человеком, чем можно было предположить по внешнему виду."
],
[
"Don't be fooled by his appearance."
,
"Не обманывайтесь его внешностью."
],
[
"She had a decidedly down-at-heel appearance."
,
"Вид у нее был явно неуклюжий."
],
[
"I bought these shoes for their practicality not their appearance."
,
"Я купил эти туфли из-за их практичности, а не из-за внешнего вида."
],
[
"The most striking feature of his appearance was his long hair."
,
"Самой яркой чертой его внешности были длинные волосы."
],
[
"Her only screen appearances were in two made-for-television movies."
,
"Ее единственные появления на экране были в двух телевизионных фильмах."
],
[
"It was his first television appearance."
,
"Это было его первое появление на телевидении."
],
[
"Bevan was the architect of the British National Health Service."
,
"Беван был архитектором Британской национальной службы здравоохранения."
],
[
"After years of study, Tim is now a fully-fledged architect."
,
"После многих лет обучения Тим стал полноценным архитектором."
],
[
"The architect has quoted £10,000 to build an extension."
,
"Архитектор выделил 10 000 фунтов стерлингов на строительство пристройки."
],
[
"She is a highly recommended architect."
,
"Она очень рекомендуемый архитектор."
],
[
"He is probably the best known living architect."
,
"Вероятно, он самый известный из ныне живущих архитекторов."
],
[
"The architect showed us the house plans that she had drawn up."
,
"Архитектор показала нам составленные ею планы дома."
],
[
"The architects have made imaginative use of glass and transparent plastic."
,
"Архитекторы творчески использовали стекло и прозрачный пластик."
],
[
"Doug and Wendy worked with an architect to create their dream home."
,
"Дуг и Венди работали с архитектором, чтобы создать дом своей мечты."
],
[
"fig. President Roosevelt was the architect of the New Deal during the Great Depression."
,
"инжир. Президент Рузвельт был архитектором «Нового курса» во время Великой депрессии."
],
[
"to study architecture"
,
"изучать архитектуру"
],
[
"Roman architecture"
,
"Римская архитектура"
],
[
"Modernist architecture tries to conquer nature instead of working with it."
,
"Модернистская архитектура пытается покорить природу, а не работать с ней."
],
[
"This is a prime example of 1930s architecture."
,
"Это яркий пример архитектуры 1930-х годов."
],
[
"The town's modern architecture is very well integrated with the old."
,
"Современная архитектура города очень хорошо сочетается со старой."
],
[
"I like the clean-cut shapes of classical architecture."
,
"Мне нравятся четкие формы классической архитектуры."
],
[
"modern/classical/Gothic architecture"
,
"современная/классическая/готическая архитектура"
],
[
"He studied architecture with Gropius."
,
"Он изучал архитектуру у Гропиуса."
],
[
"Framed architectural drawings hung on the walls of his office."
,
"На стенах его кабинета висели архитектурные чертежи в рамках."
],
[
"He earned a master's degree in architecture."
,
"Он получил степень магистра архитектуры."
],
[
"environmentally sustainable architecture"
,
"экологически устойчивая архитектура"
],
[
"Their software architecture is good and they continue to show good growth."
,
"У них хорошая архитектура программного обеспечения, и они продолжают демонстрировать хороший рост."
]
]
