
[
[
"According to our records, she was absent last Friday."
,
"По нашим данным, она отсутствовала в прошлую пятницу."
],
[
"He didn't actually say anything important."
,
"На самом деле он не сказал ничего важного."
],
[
"So what actually happened?"
,
"Так что же на самом деле произошло?"
],
[
"She sounds English but she's actually Spanish."
,
"Она звучит по-английски, но на самом деле она испанка."
],
[
"Did you actually meet the president?"
,
"Вы действительно встречались с президентом?"
],
[
"You didn't tell me. Actually, I did."
,
"Ты мне не сказал. На самом деле, я это сделал."
],
[
"Do you mind if I smoke? Actually, I'd rather you didn't."
,
"Ты не против если я покурю? Вообще-то, я бы предпочел, чтобы ты этого не делал."
],
[
"One of the advantages of living in town is having the shops so near."
,
"Одним из преимуществ жизни в городе является близость магазинов."
],
[
"These new routes will give the airline a considerable advantage over its competitors."
,
"Новые маршруты дадут авиакомпании значительное преимущество перед конкурентами."
],
[
"By half time we had a 2-0 advantage."
,
"К перерыву у нас было преимущество 2:0."
],
[
"If we could start early it would be to our advantage."
,
"Если бы мы могли начать раньше, это было бы в наших интересах."
],
[
"I thought I'd take advantage of the sports facilities while I'm here."
,
"Я подумал, что воспользуюсь спортивными сооружениями, пока буду здесь."
],
[
"Companies are not allowed to advertise cigarettes on television any more."
,
"Компаниям больше не разрешается рекламировать сигареты по телевидению."
],
[
"The university is advertising for administrative staff."
,
"Университет объявляет рекламу на управленческий персонал."
],
[
"a newspaper/television advertisement"
,
"газетная/телевизионная реклама"
],
[
"an advertising agency"
,
"рекламное агентство"
],
[
"She works in advertising."
,
"Она работает в рекламе."
],
[
"The hotel wasn't great but it was all right."
,
"Отель не был отличным, но все было в порядке."
],
[
"It's a cheap wine but it tastes all right."
,
"Это дешевое вино, но на вкус оно нормальное."
],
[
"I'm all right thanks. How are you?"
,
"Со мной все в порядке, спасибо. Как вы?"
],
[
"Did you get home all right last night?"
,
"Ты хорошо добрался домой вчера вечером?"
],
[
"Smoking is not allowed in the restaurant."
,
"Курение в ресторане запрещено."
],
[
"Are dogs allowed in the hotel?"
,
"Разрешается ли размещение с собаками в отеле?"
],
[
"You are not allowed to use calculators UK in the exam/US on the exam."
,
"Вам не разрешается использовать калькуляторы в Великобритании на экзамене/США на экзамене."
],
[
"Patients are not allowed visitors after nine o'clock."
,
"Пациенты не допускаются к посещениям после девяти часов."
],
[
"They have allowed the problem to get worse."
,
"Они позволили проблеме усугубиться."
],
[
"The extra money will allow me to upgrade my computer."
,
"Дополнительные деньги позволят мне обновить мой компьютер."
],
[
"Allow three hours for the whole journey."
,
"На всю дорогу отведите три часа."
],
[
"She walked home by herself, although she knew it was dangerous."
,
"Она пошла домой одна, хотя знала, что это опасно."
],
[
"He's coming this evening, although I don't know exactly when."
,
"Он приедет сегодня вечером, хотя я не знаю точно, когда."
],
[
"ancient Greece/Rome"
,
"Древняя Греция/Рим"
],
[
"an ancient building"
,
"древнее здание"
],
[
"This computer is ancient."
,
"Этот компьютер древний."
],
[
"I fell over and twisted my ankle."
,
"Я упал и подвернул лодыжку."
],
[
"The nurse bandaged my sprained ankle to keep the swelling down."
,
"Медсестра перевязала мне вывихнутую лодыжку, чтобы уменьшить опухоль."
],
[
"Of course I don't mind taking you home - I'm going that way anyway."
,
"Конечно, я не против отвезти тебя домой — я все равно поеду туда."
],
[
"I thought you said everyone had left. Well, some of them have anyway."
,
"Я думал, ты сказал, что все ушли. Ну, некоторые из них так или иначе."
],
[
"Her parents were opposed to her giving up her course, but she did it anyway."
,
"Ее родители были против того, чтобы она бросила курс, но она все равно это сделала."
],
[
"Anyway, as I said, I'll be away next week."
,
"В любом случае, как я уже сказал, на следующей неделе меня не будет."
],
[
"Anyway, in the end I didn't wear your jacket."
,
"В любом случае, в конце концов я не надел твою куртку."
],
[
"What was he doing with so much of the company's money in his personal account anyway?"
,
"Что он вообще делал с такой большой частью денег компании на своем личном счете?"
],
[
"I don't have time to go, and anyway it's too expensive."
,
"У меня нет времени идти, да и вообще это слишком дорого."
],
[
"The meal isn't nearly ready yet, but I expect that they'll be late anyway."
,
"Еда еще не почти готова, но я думаю, что они все равно опоздают."
],
[
"Even if it is pouring with rain, the event will take place anyway."
,
"Даже если льёт дождь, мероприятие всё равно состоится."
],
[
"Of course I don’t mind taking you home – I’m going that way anyway."
,
"Конечно, я не против отвезти тебя домой – я все равно поеду туда."
],
[
"So anyway, what are you going to do tonight?"
,
"И вообще, что ты собираешься делать сегодня вечером?"
],
[
"Anyway, in the end we just agreed to stop seeing each other."
,
"В любом случае, в конце концов мы просто договорились перестать видеться."
]
]
